<?php

#=================================================[╜щ┤№▓╜еыб╝е┴еє]====

#е░еэб╝е╨еы╩╤┐Їд╬╜щ┤№▓╜
$StdLib 	= "lib/kstd.php";
$SqlLib 	= "lib/ksql.php";
$JcodeLib 	= "lib/jcode.php";
$Mimelib	= "lib/mimew.php";
$Glib		= "lib/hlib.php";
$MainINIFile	= "ini/h.ini";
$ThisFile	= $SCRIPT_NAME;

#---------------------------------------------------------------------

require "$StdLib";	#екеъе╕е╩еы╔╕╜рещеде╓ещеъ╜щ┤№▓╜
require "$SqlLib";	#г╙г╤г╠ещеде╓ещеъ╜щ┤№▓╜
#require "$JcodeLib";	#╩╕╗·е│б╝е╔╩╤┤╣ещеде╓ещеъ╜щ┤№▓╜
#require "$Mimelib";	#г═г╔г═г┼ещеде╓ещеъ╜щ┤№▓╜
require "$Glib";	#hamada-rещеде╓ещеъ╜щ┤№▓╜

Init_Form("euc");
Init_Tag();

$INI = array();
$INI = InitINIData(1,$MainINIFile);

#г╙г╤г╠╜щ┤№▓╜
Init_SQL();

Init_H();

#==================================================================================[еседеєеыб╝е┴еє]==
#б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·
#====================================================================================================

#╜щ┤№▓╜
$act = GetVal("act");
if($act == "") {
	$act = "menu";
}

if(file_exists("lib/admin/" . $act . ".php")) {
	require "lib/admin/" . $act . ".php";
}






#г╙г╤г╠└▄┬│
ConnectSQL();

#е█б╝еы
if($act == "menu") {

	$K = ConvVal(ReadFileData("html/admin_menu.html",3));

} elseif($act == "db") {

	DB();

} elseif($act == "sub") {

	SUB();

} elseif($act == "csvupload") {

	CSVUpload();

} else {

	$K = "$AdminTitle";

}

PB_ADMIN();

#г╙г╤г╠└▄┬│
DisconnectSQL();



exit;

#====================================================================================[е╡е╓еыб╝е┴еє]==
#б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·
#====================================================================================================


#======================================================================================[ещеде╓ещеъ]==
#б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·б·
#====================================================================================================






?>